Microchip-MPLAB-Harmony/bootloader_apps_uart/apps/uart_fail_safe_bootloader/bootloader/firmware/src/packs/PIC32CX2051MTSH128_DFP/component/matrix.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief MATRIX_PR register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_PRAS;        /**< Offset: 0x00 (R/W  32) Priority Register A for Slave 0 */
  __IO  uint32_t                       MATRIX_PRBS;        /**< Offset: 0x04 (R/W  32) Priority Register B for Slave 0 */
} matrix_pr_registers_t;

#define MATRIX_PR_NUMBER 16

/** \brief MATRIX register API structure */
typedef struct
{
  __IO  uint32_t                       MATRIX_MCFG[16];    /**< Offset: 0x00 (R/W  32) Master Configuration Register */
  __IO  uint32_t                       MATRIX_SCFG[16];    /**< Offset: 0x40 (R/W  32) Slave Configuration Register */
        matrix_pr_registers_t          MATRIX_PR[MATRIX_PR_NUMBER]; /**< Offset: 0x80  */
  __IO  uint32_t                       MATRIX_MRCR;        /**< Offset: 0x100 (R/W  32) Master Remap Control Register */
  __I   uint8_t                        Reserved1[0x0C];
  __IO  uint32_t                       MATRIX_SFR[16];     /**< Offset: 0x110 (R/W  32) Special Function Register */
  __O   uint32_t                       MATRIX_MEIER;       /**< Offset: 0x150 ( /W  32) Master Error Interrupt Enable Register */
  __O   uint32_t                       MATRIX_MEIDR;       /**< Offset: 0x154 ( /W  32) Master Error Interrupt Disable Register */
  __I   uint32_t                       MATRIX_MEIMR;       /**< Offset: 0x158 (R/   32) Master Error Interrupt Mask Register */
  __I   uint32_t                       MATRIX_MESR;        /**< Offset: 0x15C (R/   32) Master Error Status Register */
  __I   uint32_t                       MATRIX_MEAR[16];    /**< Offset: 0x160 (R/   32) Master 0 Error Address Register */
  __I   uint8_t                        Reserved2[0x44];
  __IO  uint32_t                       MATRIX_WPMR;        /**< Offset: 0x1E4 (R/W  32) Write Protect Mode Register */
  __I   uint32_t                       MATRIX_WPSR;        /**< Offset: 0x1E8 (R/   32) Write Protect Status Register */
  __I   uint8_t                        Reserved3[0x10];
  __I   uint32_t                       MATRIX_VERSION;     /**< Offset: 0x1FC (R/   32) Version Register */
  __IO  uint32_t                       MATRIX_PSR[16];     /**< Offset: 0x200 (R/W  32) Protection Slave 0 Register */
  __IO  uint32_t                       MATRIX_PASSR[16];   /**< Offset: 0x240 (R/W  32) Protected Areas Split Slave 0 Register */
  __IO  uint32_t                       MATRIX_PRTSR[16];   /**< Offset: 0x280 (R/W  32) Protected Region Top Slave 0 Register */
  __IO  uint32_t                       MATRIX_PPSELR[3];   /**< Offset: 0x2C0 (R/W  32) Protected Peripheral Select 1 Register */
} matrix_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _PIC32CXMTSH_MATRIX_COMPONENT_H_ */
